madubois/nrf9160-feather-examples-and-drivers/samples/kraken_tracker/src/main.c
/*
 * Copyright (c) 2019 Nordic Semiconductor ASA
 *
 * SPDX-License-Identifier: LicenseRef-Nordic-5-Clause
 */

#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <math.h>
#include <zephyr/kernel.h>
#include <zephyr/logging/log.h>
#include <nrf_modem_at.h>
#include <nrf_modem_gnss.h>
#include <modem/lte_lc.h>
#include <modem/nrf_modem_lib.h>
#include <date_time.h>


#include <zephyr/drivers/i2c.h>

#include <math.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <math.h>
#include <zephyr/kernel.h>
#include <zephyr/logging/log.h>
#include <nrf_modem_at.h>
#include <nrf_modem_gnss.h>
#include <modem/lte_lc.h>
#include <modem/nrf_modem_lib.h>
#include <date_time.h>

#include <zephyr/net/socket.h>
#include <zephyr/kernel.h>
#include <zephyr/dfu/mcuboot.h>
#include <zephyr/sys/reboot.h>
#include <zephyr/sys/crc.h>
#include <zephyr/storage/flash_map.h>
#include <zephyr/dfu/flash_img.h>
#include <zephyr/drivers/sensor.h>
#include <zephyr/sys/reboot.h>
#include <time.h>

#include "battery.h"
#include "spectre_logo.h"



LOG_MODULE_REGISTER(gnss_sample, CONFIG_GNSS_SAMPLE_LOG_LEVEL);

static void log_modem_state(const char *stage)
{
	char response[512];
	int err;

	LOG_INF("%s antenna config: COEX0=%s", stage, CONFIG_MODEM_ANTENNA_AT_COEX0);

	err = nrf_modem_at_cmd(response, sizeof(response), "AT%%XSYSTEMMODE?");
	if (err == 0) {
		LOG_INF("%s XSYSTEMMODE: %s", stage, response);
	} else {
		LOG_WRN("%s XSYSTEMMODE query failed: %d", stage, err);
	}

	err = nrf_modem_at_cmd(response, sizeof(response), "AT+CFUN?");
	if (err == 0) {
		LOG_INF("%s CFUN: %s", stage, response);
	} else {
		LOG_WRN("%s CFUN query failed: %d", stage, err);
	}

	err = nrf_modem_at_cmd(response, sizeof(response), "AT%%XCOEX0?");
	if (err == 0) {
		LOG_INF("%s XCOEX0: %s", stage, response);
	} else {
		LOG_WRN("%s XCOEX0 query failed: %d", stage, err);
	}

	err = nrf_modem_at_cmd(response, sizeof(response), "AT%%XMAGPIO?");
	if (err == 0) {
		LOG_INF("%s XMAGPIO: %s", stage, response);
	} else {
		LOG_WRN("%s XMAGPIO query failed: %d", stage, err);
	}

	err = nrf_modem_at_cmd(response, sizeof(response), "AT%%XMONITOR");
	if (err == 0) {
		LOG_INF("%s XMONITOR: %s", stage, response);
	} else {
		LOG_WRN("%s XMONITOR query failed: %d", stage, err);
	}
}



#define SSD1306_I2C_ADDR 0x3D
#define SSD1306_WIDTH 128
#define SSD1306_HEIGHT 64
#define SSD1306_PAGES (SSD1306_HEIGHT / 8)

// Fonction pour envoyer une commande à l'écran
static int ssd1306_write_cmd(const struct device *i2c_dev, uint8_t cmd) {
    uint8_t buf[2] = {0x00, cmd}; // 0x00 = Control byte pour commande
    return i2c_write(i2c_dev, buf, 2, SSD1306_I2C_ADDR);
}

// Fonction pour envoyer des données (pixels)
static int ssd1306_write_data(const struct device *i2c_dev, uint8_t data) {
    uint8_t buf[2] = {0x40, data}; // 0x40 = Control byte pour data
    return i2c_write(i2c_dev, buf, 2, SSD1306_I2C_ADDR);
}

static int ssd1306_write_data_block(const struct device *i2c_dev, const uint8_t *data, size_t len)
{
	uint8_t buf[1 + 6];

	if (len > 6) {
		return -EINVAL;
	}

	buf[0] = 0x40;
	memcpy(&buf[1], data, len);
	return i2c_write(i2c_dev, buf, len + 1, SSD1306_I2C_ADDR);
}


static uint8_t framebuffer[SSD1306_WIDTH][SSD1306_PAGES] = {0};
static struct k_mutex display_mutex;

void clear_display(const struct device *i2c_dev);



void allumer_pixel(const struct device *i2c_dev, uint8_t x, uint8_t y) {
	if (x >= SSD1306_WIDTH || y >= SSD1306_HEIGHT) return;
	k_mutex_lock(&display_mutex, K_FOREVER);
    //extern uint8_t framebuffer[128][4]; // ou déclare-le globalement
    uint8_t page = y / 8;
    uint8_t bit = y % 8;
    framebuffer[x][page] |= (1 << bit);

    // Positionne le curseur sur la colonne et la page
    ssd1306_write_cmd(i2c_dev, 0x21); // Set column address
    ssd1306_write_cmd(i2c_dev, x);    // Start column
    ssd1306_write_cmd(i2c_dev, x);    // End column
    ssd1306_write_cmd(i2c_dev, 0x22); // Set page address
    ssd1306_write_cmd(i2c_dev, page); // Start page
    ssd1306_write_cmd(i2c_dev, page); // End page

    // Écrit la page entière (tous les bits de la colonne pour cette page)
    ssd1306_write_data(i2c_dev, framebuffer[x][page]);
	k_mutex_unlock(&display_mutex);
}

void eteindre_pixel(const struct device *i2c_dev, uint8_t x, uint8_t y) {
	if (x >= SSD1306_WIDTH || y >= SSD1306_HEIGHT) return;
	k_mutex_lock(&display_mutex, K_FOREVER);
    uint8_t page = y / 8;
    uint8_t bit = y % 8;
    framebuffer[x][page] &= ~(1 << bit);

    ssd1306_write_cmd(i2c_dev, 0x21);
    ssd1306_write_cmd(i2c_dev, x);
    ssd1306_write_cmd(i2c_dev, x);
    ssd1306_write_cmd(i2c_dev, 0x22);
    ssd1306_write_cmd(i2c_dev, page);
    ssd1306_write_cmd(i2c_dev, page);

    ssd1306_write_data(i2c_dev, framebuffer[x][page]);
	k_mutex_unlock(&display_mutex);
}

static void ssd1306_init(const struct device *i2c_dev) {
	k_mutex_lock(&display_mutex, K_FOREVER);
    ssd1306_write_cmd(i2c_dev, 0xAE); // Display OFF
    ssd1306_write_cmd(i2c_dev, 0xD5); // Set display clock divide ratio/oscillator freq
    ssd1306_write_cmd(i2c_dev, 0x80); // Default setting for display clock divide ratio
	ssd1306_write_cmd(i2c_dev, 0xA8); // Set multiplex ratio
	ssd1306_write_cmd(i2c_dev, 0x3F); // 1/64 duty
    ssd1306_write_cmd(i2c_dev, 0xD3); // Set display offset
    ssd1306_write_cmd(i2c_dev, 0x00); // No offset
    ssd1306_write_cmd(i2c_dev, 0x40); // Set start line at 0
    ssd1306_write_cmd(i2c_dev, 0x8D); // Enable charge pump regulator
    ssd1306_write_cmd(i2c_dev, 0x14);
    ssd1306_write_cmd(i2c_dev, 0x20); // Set memory addressing mode
    ssd1306_write_cmd(i2c_dev, 0x00); // Horizontal addressing mode
    ssd1306_write_cmd(i2c_dev, 0xA0); // Set segment re-map 0 to 127
    ssd1306_write_cmd(i2c_dev, 0xC0); // Set COM output scan direction remapped
	ssd1306_write_cmd(i2c_dev, 0xDA); // Set COM pins hardware configuration
	ssd1306_write_cmd(i2c_dev, 0x12); // COM config for 128x64
    ssd1306_write_cmd(i2c_dev, 0x81); // Set contrast control
    ssd1306_write_cmd(i2c_dev, 0xCF);
    ssd1306_write_cmd(i2c_dev, 0xD9); // Set pre-charge period
    ssd1306_write_cmd(i2c_dev, 0xF1);
    ssd1306_write_cmd(i2c_dev, 0xDB); // Set VCOMH deselect level
    ssd1306_write_cmd(i2c_dev, 0x40);
    ssd1306_write_cmd(i2c_dev, 0xA4); // Entire display ON (resume)
    ssd1306_write_cmd(i2c_dev, 0xA6); // Set normal display (not inverted)
    ssd1306_write_cmd(i2c_dev, 0xAF); // Display ON
	k_mutex_unlock(&display_mutex);
}

static void draw_startup_logo(const struct device *i2c_dev)
{
	uint8_t page_buf[SSD1306_WIDTH];
	uint8_t src_x;
	uint8_t src_page;

	memset(framebuffer, 0, sizeof(framebuffer));
	clear_display(i2c_dev);
	for (src_page = 0; src_page < SSD1306_PAGES; src_page++) {
		for (src_x = 0; src_x < SSD1306_WIDTH; src_x++) {
			uint8_t column = spectre_logo_128x64[(src_page * SSD1306_WIDTH) + src_x];
			framebuffer[src_x][src_page] = column;
		}
	}

