madubois/nrf9160-feather-examples-and-drivers/samples/kraken_tracker/src/main.c
	return 0;
}























float targets[10];
const struct device *i2c_dev = DEVICE_DT_GET(DT_NODELABEL(i2c1));
int targets_count = 0;

uint8_t last_tracked = 0;
uint8_t last_in_fix = 0;
uint8_t last_unhealthy = 0;

uint8_t gps_tracking = 0;
uint8_t gps_using = 0;
uint8_t gps_unk = 0;


double last_latitude = 0;
double last_longitude = 0;

double ref_latitude2 = 0;
double ref_longitude2 = 0;

int lte_wait = 0;
int lte_quota = 10;

volatile int position=0;
float lat[5];
float lng[5];
time_t ts[5];

#define HTTP_HOST "plongee.duckdns.org"
#define HTTP_PATH "/targets"
#define HTTP_PATH_LONG "/coords"
#define HTTP_PORT 8545
#define MAX_MTU_SIZE     2000
#define RECV_BUF_SIZE    2048
#define SEND_BUF_SIZE    MAX_MTU_SIZE
#define MAX_DISPLAY_TARGETS 4

static int displayed_targets_count = -1;
static int displayed_heading[MAX_DISPLAY_TARGETS] = { -1, -1, -1, -1 };
static int displayed_distance[MAX_DISPLAY_TARGETS] = { -1, -1, -1, -1 };

void write_line(const struct device *i2c_dev, const char *line, uint8_t x, uint8_t y, int erase);

static void reset_target_value_cache(void)
{
	for (int i = 0; i < MAX_DISPLAY_TARGETS; i++) {
		displayed_heading[i] = -1;
		displayed_distance[i] = -1;
	}
}

static void clear_target_rows(const struct device *i2c_dev, uint8_t base_y)
{
	char blank_row[23];
	memset(blank_row, ' ', sizeof(blank_row) - 1);
	blank_row[sizeof(blank_row) - 1] = '\0';

	for (int row = 0; row < MAX_DISPLAY_TARGETS; row++) {
		uint8_t y = base_y + (row * 8);
		write_line(i2c_dev, blank_row, 0, y, 0);
	}
}

static void draw_target_rows_layout(const struct device *i2c_dev, int count, uint8_t base_y)
{
	uint8_t y = base_y;
	char message[16];

	if (count < 0) {
		count = 0;
	}
	if (count > MAX_DISPLAY_TARGETS) {
		count = MAX_DISPLAY_TARGETS;
	}

	clear_target_rows(i2c_dev, base_y);

	for (int i = 0; i < count; i++) {
		if (y > (SSD1306_HEIGHT - 8)) {
			break;
		}

		snprintf(message, sizeof(message), "%1d:", i + 1);
		write_line(i2c_dev, message, 0, y, 0);
		write_line(i2c_dev, "DEG", 7 * 6, y, 0);
		write_line(i2c_dev, "|", 12 * 6, y, 0);
		write_line(i2c_dev, "M", 20 * 6, y, 0);

		y += 8;
	}

	displayed_targets_count = count;
	reset_target_value_cache();
}

#define JSON_TEMPLATE "%ld,%.9f,%.9f"
#define JSON_TEMPLATE_LONG "%ld,%.9f,%.9f,%ld,%.9f,%.9f,%ld,%.9f,%.9f,%ld,%.9f,%.9f,%ld,%.9f,%.9f"

char send_buf[2000];

bool gps_state = 1;
bool lte_state = 0;
time_t timestamp;
volatile float avg = 0;
float thresold = 19;
int reset_threshold = 20;

int refresh_rate = 1000;
int confirmation_rate = 20;

int menu = -1;

enum tap_direction {
	TAP_NONE = 0,
	TAP_UP,
	TAP_DOWN,
	TAP_LEFT,
	TAP_RIGHT,
};

static struct k_mutex tap_mutex;
static volatile enum tap_direction pending_tap = TAP_NONE;
static volatile bool wake_request = false;
static struct k_sem wake_sem;
static struct k_mutex motion_mutex;
static struct k_condvar motion_cond;
static bool motion_active = true;
static const struct device *accel_sensor;
static int64_t off_wake_armed_after_ms;
static volatile bool off_mode_active;
static volatile int64_t off_wake_first_motion_ms;
static volatile int64_t off_wake_last_motion_ms;
static volatile int off_wake_poll_streak;
static volatile bool off_wake_probe_active;
static volatile int64_t menu_wake_first_motion_ms;
static volatile int64_t menu_wake_last_motion_ms;
static volatile int menu_wake_poll_streak;
static volatile bool menu_wake_probe_active;
static const float off_wake_start_threshold_ms2 = 1.20f;
static const float off_wake_hold_threshold_ms2 = 0.60f;
static const int off_wake_hold_ms = 700;
static const int off_wake_event_gap_ms = 180;
static const int off_wake_idle_wait_ms = 250;
static const int off_wake_fast_wait_ms = 30;
static const int off_wake_odr_hz = 12;
static const int active_odr_hz = 100;
static const int logo_preview_ms = 5000;
static const struct sensor_trigger wake_trigger = {
	.type = SENSOR_TRIG_DELTA,
	.chan = SENSOR_CHAN_ACCEL_XYZ,
};

/* Tune these values on hardware if needed. */
static float tap_delta_threshold = 1.45f;
static float tap_release_threshold = 0.50f;
static float tap_axis_dominance = 1.30f;
static float tap_direction_margin = 0.40f;
static int tap_direction_window_ms = 20;
static float tap_peak_weight = 0.60f;
static int tap_deadtime_ms = 250;
static int tap_boot_guard_ms = 7000;
static int tap_menu_confirm_guard_ms = 450;

/* Physical mounting orientation mapping. */
static bool top_is_negative_y = true;
static bool left_is_negative_x = true;

extern volatile float linear_x;
extern volatile float linear_y;
extern volatile float linear_z;

float sensor_value_to_float(const struct sensor_value *val);

static void off_wake_reset_motion(void);

static bool off_wake_register_motion(int64_t now_ms)
{
	int64_t previous_motion_ms;

	if (!off_mode_active || (now_ms < off_wake_armed_after_ms)) {
		return false;
	}

	previous_motion_ms = off_wake_last_motion_ms;
	if (off_wake_first_motion_ms == 0 ||
	    (now_ms - previous_motion_ms) > off_wake_event_gap_ms) {
		off_wake_first_motion_ms = now_ms;
		off_wake_last_motion_ms = now_ms;
		return false;
	}

	off_wake_last_motion_ms = now_ms;

	return (now_ms - off_wake_first_motion_ms) >= off_wake_hold_ms;
}

static void off_wake_reset_motion(void)
{
	off_wake_first_motion_ms = 0;
	off_wake_last_motion_ms = 0;
	off_wake_poll_streak = 0;
	off_wake_probe_active = false;
}

static bool menu_wake_register_motion(int64_t now_ms)
{
	int64_t previous_motion_ms;

	previous_motion_ms = menu_wake_last_motion_ms;
	if (menu_wake_first_motion_ms == 0 ||
	    (now_ms - previous_motion_ms) > off_wake_event_gap_ms) {
		menu_wake_first_motion_ms = now_ms;
		menu_wake_last_motion_ms = now_ms;
		return false;
	}

	menu_wake_last_motion_ms = now_ms;

	return (now_ms - menu_wake_first_motion_ms) >= off_wake_hold_ms;
}

static void menu_wake_reset_motion(void)
{
	menu_wake_first_motion_ms = 0;
	menu_wake_last_motion_ms = 0;
	menu_wake_poll_streak = 0;
	menu_wake_probe_active = false;
}

static bool menu_wake_poll_motion(int64_t now_ms)
{
	float linear_mag;
	float lx = linear_x;
	float ly = linear_y;
	float lz = linear_z;

