madubois/nrf9160-feather-examples-and-drivers/samples/kraken_tracker/src/main.c
	return err;
}

void initial_connexion(){
	LOG_INF("initial_connexion: begin fetching targets");
	startup_stage = STARTUP_STAGE_DNS;

	int err = 0;

	struct sockaddr_in local_addr;
    struct addrinfo *res;
    int send_data_len;
    int num_bytes;
   
    local_addr.sin_family = AF_INET;
    local_addr.sin_port = htons(0);
    local_addr.sin_addr.s_addr = 0;


	struct addrinfo hints = {
		.ai_family = AF_INET,
		.ai_socktype = SOCK_DGRAM,
        .ai_next = NULL,
        .ai_addr = NULL,
		.ai_protocol = 0,
	};

    err = getaddrinfo(HTTP_HOST, NULL, &hints, &res);
    LOG_INF("getaddrinfo err: %d", err);
	if (err != 0) {
		startup_stage = STARTUP_STAGE_ERROR;
		return;
	}
	
    ((struct sockaddr_in *)res->ai_addr)->sin_port = htons(HTTP_PORT);
   

    int client_fd = socket(AF_INET, SOCK_STREAM, 0);

    LOG_INF("client_fd: %d", client_fd);
	if (client_fd < 0) {
		startup_stage = STARTUP_STAGE_ERROR;
		freeaddrinfo(res);
		return;
	}
    err = bind(client_fd, (struct sockaddr *)&local_addr,sizeof(local_addr));
    LOG_INF("bind err: %d", err);


	startup_stage = STARTUP_STAGE_TCP_CONNECT;
	err = blocking_connect(client_fd, (struct sockaddr *)res->ai_addr,sizeof(struct sockaddr_in));
    LOG_INF("connect err: %d", err);


	if (err >= 0) {

	startup_stage = STARTUP_STAGE_HTTP_REQUEST;


	send_data_len = snprintf(send_buf, 2000,
                                     "GET %s HTTP/1.1\r\n"
                                     "Host: %s\r\n\r\n",
                                     HTTP_PATH, HTTP_HOST);



    do {
        num_bytes =
        blocking_send(client_fd, send_buf, send_data_len, 0);
       
        if (num_bytes < 0) {
            LOG_INF("ret: %d, errno: %s\n", num_bytes, strerror(errno));
        };
		

    } while (num_bytes < 0);

	static char recv_buf[RECV_BUF_SIZE * 2];
	memset(recv_buf, 0, sizeof(recv_buf));
	int tot_num_bytes = 0;
	int recv_offset = 0;
	startup_stage = STARTUP_STAGE_WAIT_SERVER;
	struct timeval recv_timeout = {
		.tv_sec = 5,
		.tv_usec = 0,
	};
	setsockopt(client_fd, SOL_SOCKET, SO_RCVTIMEO, &recv_timeout, sizeof(recv_timeout));

	do {
		/* TODO: make a proper timeout *
		 * Current solution will just hang 
		 * until remote side closes connection */
		num_bytes = recv(client_fd, recv_buf + recv_offset,
				 sizeof(recv_buf) - recv_offset - 1, 0);
		if (num_bytes > 0) {
			tot_num_bytes += num_bytes;
		}
                LOG_INF("total number of bytes: %d\n", tot_num_bytes);
                LOG_INF("num bytes: %d\n", num_bytes);
		if (num_bytes < 0) {
			if (errno == EAGAIN || errno == EWOULDBLOCK) {
				LOG_INF("recv timeout after %d bytes", tot_num_bytes);
				break;
			}
			LOG_INF("\nrecv errno: %d\n", errno);
			break;
		}
		if (num_bytes == 0) {
			break;
		}
		recv_offset += num_bytes;
		recv_buf[recv_offset] = '\0';
		//LOG_INF("%s\n", recv_buf);
	} while (num_bytes > 0);

	startup_stage = STARTUP_STAGE_PARSE;

    double values[10];                       // Tableau pour stocker les doubles
    size_t count = 0;
	char *body = strstr(recv_buf, "\r\n\r\n");
	if (body != NULL) {
		body += 4;
	} else {
		body = recv_buf;
	}

	LOG_INF("Targets response body starts with: %.80s", body);

	char *scan = body;
	while (*scan != '\0' && count < 10) {
		char *endptr;
		double parsed = strtod(scan, &endptr);

		if (endptr == scan) {
			scan++;
			continue;
		}

		values[count] = parsed;
		count++;
		scan = endptr;
	}

	targets_count = (count / 2);
	if (targets_count > MAX_DISPLAY_TARGETS) {
		LOG_WRN("Parsed %u targets; clamping display to %u", targets_count, MAX_DISPLAY_TARGETS);
		targets_count = MAX_DISPLAY_TARGETS;
	}
	LOG_INF("Parsed %u coordinate pairs from server", targets_count);


    // Afficher les résultats
    for (size_t i = 0; i < targets_count*2; i++) {
		targets[i] = values[i];
    }

	startup_stage = STARTUP_STAGE_READY;

    LOG_INF("Finished. Closing socket");
    err = close(client_fd);
	    LOG_INF("initial_connexion: socket closed");
	    freeaddrinfo(res);
	    LOG_INF("initial_connexion: done");

	} else {
		startup_stage = STARTUP_STAGE_ERROR;
	}
}

void flash_firmware(){

	int err = 0;

	int k = 0;
	while(lte_lc_connect()!= 0) {
		k+=1;
				LOG_INF("Waiting for LTE connection, attempt %d", k);

		if(k >= 5){
			return;
		}
	}

		LOG_INF("Connected to LTE network");

		

	struct flash_img_context fic;

	struct sockaddr_in local_addr;
    struct addrinfo *res;
    int send_data_len;
    int num_bytes;
   
    local_addr.sin_family = AF_INET;
    local_addr.sin_port = htons(0);
    local_addr.sin_addr.s_addr = 0;


	struct addrinfo hints = {
		.ai_family = AF_INET,       //1
		.ai_socktype = SOCK_DGRAM,  //2
        .ai_next = NULL,
        .ai_addr = NULL,
        .ai_protocol = 0   //any protocol
	};



	flash_img_init_id(&fic, PM_MCUBOOT_SECONDARY_ID); // Or appropriate slot ID
	boot_erase_img_bank(PM_MCUBOOT_SECONDARY_ID);

	
    err = getaddrinfo(HTTP_HOST, NULL, &hints, &res);	
    ((struct sockaddr_in *)res->ai_addr)->sin_port = htons(HTTP_PORT);

    int client_fd = socket(AF_INET, SOCK_STREAM, 0);

    err = bind(client_fd, (struct sockaddr *)&local_addr,sizeof(local_addr));
    err = blocking_connect(client_fd, (struct sockaddr *)res->ai_addr,sizeof(struct sockaddr_in));

	if (err >= 0) {
	
	send_data_len = snprintf(send_buf, 2000,
                                     "GET %s HTTP/1.1\r\n"
                                     "Host: %s\r\n\r\n",
                                     "/firmware", HTTP_HOST);



    do {
        num_bytes = blocking_send(client_fd, send_buf, send_data_len, 0);
       
        if (num_bytes < 0) {
            LOG_INF("ret: %d, errno: %s\n", num_bytes, strerror(errno));
        };
		

    } while (num_bytes < 0);

	char recv_buf[RECV_BUF_SIZE];
	int tot_num_bytes = 0;

	do {
		/* TODO: make a proper timeout *
		 * Current solution will just hang 
		 * until remote side closes connection */
		num_bytes = recv(client_fd, recv_buf, RECV_BUF_SIZE, 0);
		tot_num_bytes += num_bytes;
                LOG_INF("total number of bytes: %d\n", tot_num_bytes);
                LOG_INF("num bytes: %d\n", num_bytes);


		err = flash_img_buffered_write(&fic, recv_buf, num_bytes, false);
        if (err) {
            printk("Erreur écriture flash: %d\n", err);
            break;
        }
		
				
		if (num_bytes < 0) {
			LOG_INF("\nrecv errno: %d\n", errno);
			break;
		}
	} while (num_bytes > 0);

