madubois/nrf9160-feather-examples-and-drivers/samples/kraken_tracker/src/main.c
							}
							//print_distance_from_reference(&last_pvt);


						} else {
							gnss_has_fix = false;

							last_fix = (uint32_t)((k_uptime_get() - fix_timestamp) / 1000);
							gnss_display_dirty = true;

							if (gps_capture_mode == GPS_CAPTURE_ACTIVE &&
							    gps_seen_fix_since_reactivate &&
							    ((int64_t)last_fix * 1000) >= GPS_DORMANT_TIMEOUT_MS) {
								gps_capture_mode = GPS_CAPTURE_DORMANT;
								gnss_display_dirty = true;
								LOG_INF("GPS capture dormant: signal lost for 2 minutes after at least one fix");
							}

							if ((k_uptime_get_32() - last_gnss_diag) >= 5000U) {
								LOG_WRN("GNSS searching: tracked=%u used=%u unhealthy=%u last_fix=%us antenna=%s",
									gps_tracking,
									gps_using,
									gps_unk,
									last_fix,
									gnss_antenna_mode());
								last_gnss_diag = k_uptime_get_32();
							}

						}

}



}

void exit_menu(const struct device *i2c_dev){

	menu = -1;
	clear_display(i2c_dev);

}

void change_gps(const struct device *i2c_dev){

uint8_t x = 5*6, y = 8;
char message[128];
if(gps_state == 0){
	gps_state = 1;
	snprintf(message, sizeof(message), " ON ");
						}else{
							gps_state = 0;
							snprintf(message, sizeof(message), " OFF");
						}
				for (const char *p = message; *p; p++) {
					dessiner_caractere(i2c_dev, *p, x, y,1);
					x += 6;

				}
}

void change_lte(const struct device *i2c_dev){

uint8_t x = 5*6, y = 16;
char message[128];
if(lte_state == 0){
	lte_state = 1;
	snprintf(message, sizeof(message), " ON ");
						}else{
							lte_state = 0;
							snprintf(message, sizeof(message), " OFF");
						}
				for (const char *p = message; *p; p++) {
					dessiner_caractere(i2c_dev, *p, x, y,1);
					x += 6;

				}
}

void reload_coordinates(const struct device *i2c_dev){

	if(lte_state == 0){return;}

	clear_display(i2c_dev);

	uint8_t x = 0, y = 0;
	char line[128];
	snprintf(line,sizeof(line),"INITIALIZATION...");
	write_line(i2c_dev, line, x, y, 0);


	initial_connexion();

	menu = -1;
	first = 0;
}


void coordinates_thread(void *a, void *b, void *c)
{
	ARG_UNUSED(a);
	ARG_UNUSED(b);
	ARG_UNUSED(c);

	/* Give GNSS priority at boot to avoid starving early satellite acquisition. */
	startup_stage = STARTUP_STAGE_GNSS_WARMUP;
	int64_t warmup_deadline = k_uptime_get() + 30000;
	while (!gnss_has_fix && k_uptime_get() < warmup_deadline) {
		k_sleep(K_SECONDS(1));
	}
	LOG_INF("coordinates_thread: GNSS warmup complete (fix=%d), starting LTE fetch", gnss_has_fix ? 1 : 0);

	while (1) {
		k_mutex_lock(&lte_mutex, K_FOREVER);
		startup_stage = STARTUP_STAGE_LTE_CONNECT;
		lte_connect();
		LOG_INF("coordinates_thread: starting coordinates fetch");
		initial_connexion();
		lte_disconnect();
		k_mutex_unlock(&lte_mutex);

		if (targets_count > 0) {
			LOG_INF("coordinates_thread: loaded %d targets", targets_count);
			startup_stage = STARTUP_STAGE_READY;
			break;
		}

		LOG_WRN("coordinates_thread: no targets yet, retrying in 60s");
		startup_stage = STARTUP_STAGE_RETRY;
		k_sleep(K_SECONDS(60));
	}
}
void firmware_update(const struct device *i2c_dev){


if(lte_state == 0){return; }

	clear_display(i2c_dev);


	uint8_t x = 5*6, y = 16;
	

	x=0;
	y=0;

		char line[128];
		snprintf(line,sizeof(line),"Initialization...");
		for (const char *p = line; *p; p++) {
			dessiner_caractere(i2c_dev, *p, x, y,0);
			x += 6;

		}









	flash_firmware();


	menu = -1;
	first = 0;

}

void ssd1306_power_off(const struct device *i2c_dev) {
	k_mutex_lock(&display_mutex, K_FOREVER);
    ssd1306_write_cmd(i2c_dev, 0xAE); // Display OFF
	k_mutex_unlock(&display_mutex);
}

void ssd1306_power_on(const struct device *i2c_dev) {
	k_mutex_lock(&display_mutex, K_FOREVER);
    ssd1306_write_cmd(i2c_dev, 0xAF); // Display ON
	k_mutex_unlock(&display_mutex);
}

void off(const struct device *i2c_dev){
	int err;
	int trigger_err;

	LOG_WRN("Entering deep sleep mode");
	menu = -1;
	first = 0;
	gps_capture_mode = GPS_CAPTURE_DORMANT;
	gps_seen_fix_since_reactivate = false;
	active_point_valid = false;
	last_new_point_ms = 0;
	gnss_display_dirty = true;
	last_tracked = 0xFF;
	last_in_fix = 0xFF;
	last_unhealthy = 0xFF;

	k_mutex_lock(&state.mutex, K_FOREVER);
	state.ready = false;
	k_mutex_unlock(&state.mutex);
	off_mode_active = true;

	if (nrf_modem_gnss_stop() != 0) {
		LOG_WRN("Failed to stop GNSS before deep sleep");
	}
	lte_disconnect();
	lte_state = 0;

	/* Clear the tap event that likely triggered OFF so we don't wake immediately. */
	pop_tap_event();
	pop_wake_request();
	k_sem_reset(&wake_sem);
	off_wake_reset_motion();
	/* Give the board time to settle so the same OFF tap does not instantly wake it back up. */
	off_wake_armed_after_ms = k_uptime_get() + 800;
	{
		struct sensor_value odr = {
			.val1 = off_wake_odr_hz,
			.val2 = 0,
		};
		int odr_err = sensor_attr_set(accel_sensor, SENSOR_CHAN_ACCEL_XYZ,
					      SENSOR_ATTR_SAMPLING_FREQUENCY, &odr);
		if (odr_err != 0) {
			LOG_WRN("Unable to lower accelerometer ODR for OFF wake: %d", odr_err);
		}
	}

	(void)wake_trigger;
	(void)wake_trigger_handler;
	trigger_err = -ENOTSUP;

	ssd1306_power_off(i2c_dev);
	tap_accept_after_ms = k_uptime_get() + (24LL * 60LL * 60LL * 1000LL);

	if (trigger_err != 0) {
		LOG_WRN("Using motion polling wake strategy");
	}

	int wait_ms = off_wake_idle_wait_ms;
	while (1) {
		if (k_sem_take(&wake_sem, K_MSEC(wait_ms)) == 0) {
			break;
		}

		if (off_wake_poll_motion(k_uptime_get())) {
			break;
		}

		wait_ms = off_wake_probe_active ? off_wake_fast_wait_ms : off_wake_idle_wait_ms;
	}

	(void)sensor_trigger_set(accel_sensor, &wake_trigger, NULL);
	{
		struct sensor_value odr = {
			.val1 = active_odr_hz,
			.val2 = 0,
		};
		int odr_err = sensor_attr_set(accel_sensor, SENSOR_CHAN_ACCEL_XYZ,
					      SENSOR_ATTR_SAMPLING_FREQUENCY, &odr);
		if (odr_err != 0) {
			LOG_WRN("Unable to restore accelerometer ODR after OFF wake: %d", odr_err);
		}
	}

	LOG_WRN("Waking from deep sleep");
	ssd1306_power_on(i2c_dev);
	draw_startup_logo(i2c_dev);
	k_sleep(K_MSEC(logo_preview_ms));
	clear_display(i2c_dev);

	gps_capture_mode = GPS_CAPTURE_REACTIVATING;
	gps_seen_fix_since_reactivate = false;
	active_point_valid = false;
	last_new_point_ms = 0;
	last_fix = 0;
	startup_stage = STARTUP_STAGE_GNSS_WARMUP;
	gnss_display_dirty = true;

	err = gnss_init_and_start();
	if (err != 0) {
		LOG_ERR("Failed to restart GNSS after deep sleep");
		startup_stage = STARTUP_STAGE_ERROR;
	} else {
		/* OFF wake is a runtime resume, not a fresh startup sequence. */
		startup_stage = (targets_count > 0) ? STARTUP_STAGE_READY : STARTUP_STAGE_RETRY;
	}

	k_mutex_lock(&state.mutex, K_FOREVER);
	state.ready = true;
	k_condvar_broadcast(&state.cond);
	k_mutex_unlock(&state.mutex);
	off_mode_active = false;
	off_wake_reset_motion();
	tap_accept_after_ms = k_uptime_get() + tap_boot_guard_ms;

